# 1. Напишите программу, которая по заданному номеру четверти, показывает 
# диапазон возможных координат точек в этой четверти (x и y).

print('Введите номер четверти системы координат: ')
num_quart = int(input())

if num_quart > 4 or num_quart < 1:
	print('Ошибка ввода! Неверно введён номер четверти!')
	exit()

elif num_quart == 1 :
	print('Номер четверти = ', num_quart, ':\nx = 1...Ꚙ', '\ny = 1...Ꚙ', end='\n')
elif num_quart == 2 :
	print('Номер четверти = ', num_quart, ':\nx = 1...Ꚙ', '\ny = -1...-Ꚙ', end='\n')
elif num_quart == 3 :
	print('Номер четверти = ', num_quart, ':\nx = -1...-Ꚙ', '\ny = -1...-Ꚙ', end='\n')
else:
	print('Номер четверти = ', num_quart, ':\nx = -1...-Ꚙ', '\ny = 1...Ꚙ', end='\n')